Repository: tyneon/memoDemo
Catalog: lib/l10n/*.arb
Languages: ru

# pageHomeTitle
source: Remind me! app
ru: Напоминалка!

# noteTextInputLabel
source: Note text
ru: Текст заметки

# noteTextInputHint
source: text goes here
ru: здесь будет текст

# noteTextInputValidationErrorEmpty
source: Note text can not be empty
ru: Текст заметки не может быть пустым

# includeDateCheckLabel
source: Include date
ru: Добавить дату

# dateInputLabel
source: Date
ru: Дата

# dateInputHint
source: Pick a date
ru: Выбор даты

# dateInputValidationErrorEmpty
source: Pick a date!
ru: Нужно выбрать дату!

# includeTimeCheckLabel
source: Include time
ru: Добавить время

# timeInputLabel
source: Time
ru: Время

# timeInputHint
source: Pick a time
ru: Выбор времени

# timeInputValidationErrorEmpty
source: Pick a time!
ru: Нужно выбрать время!

# includeLocationCheckLabel
source: Include location
ru: Добавить местоположение

# locationInputLabel
source: Location
ru: Местоположение

# locationInputHint
source: Search location
ru: Поиск местоположения

# locationInputValidationErrorEmpty
source: Select a location!
ru: Нужно выбрать местоположение!

# saveNoteButtonLabel
source: Save note
ru: Сохранить заметку

# locationSectionTitle
source: Location
ru: Местоположение

# remindersSectionTitle
source: Reminders
ru: Напоминания

# reminderTextUnspecified
source: on {date} at {time}
ru: {date} в {time}

# reminderTextSameDay
source: on the same day at {time}
ru: в тот же день в {time}

# reminderTextCountMinutesBefore
source: {count, plural, =1 {{count} minute} other {{count} minutes}} before
ru: за {count, plural, one {{count} минута} few {{count} минуты} other {{count} минут}} до

# reminderTextCountHoursBefore
source: {count, plural, =1 {{count} hour} other {{count} hours}} before
ru: за {count, plural, one {{count} час} few {{count} часа} other {{count} часов}} до

# reminderTextCountHoursMinutesBefore
source: {hcount, plural, =1 {{hcount} hour} other {{hcount} hours}} {mcount, plural, =1 {{mcount} minute} other {{mcount} minutes}} before
ru: за {hcount, plural, one {{hcount} час} few {{hcount} часа} other {{hcount} часов}} {mcount, plural, one {{mcount} минута} few {{mcount} минуты} other {{mcount} минут}} до

# reminderTextOnTheDayBefore
source: on the day before at {time}
ru: за день до в {time}

# reminderTextCountDaysBefore
source: {count, plural, =1 {{count} day} other {{count} days}} before at {time}
ru: за {count, plural, one {{count} день} few {{count} дня} other {{count} дней}} до в {time}

# noNotesText
source: No notes here yet!
ru: Заметок нет!

# pickANoteText
source: Pick a note
ru: Выбери заметку

# errorMessageText
source: Error
ru: Ошибка
